Documents/ESB/ESB_Consumer_1016/003TestSample/SAMPLE_XML_MUST/PaymentOrder/PO08_FundXferAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/PaymentOrder/FundXferAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>PaymentOrder</ServiceDomain>  
      <OperationName>FundXferAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:FundXferAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>PO08</v11:TxnId>  
        <v11:TxnNo>PO0800001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <v11:TxnType>AC01</v11:TxnType>  
          <v11:DbAcctNo>23939889</v11:DbAcctNo>  
          <v11:CrAcctNo>28825252</v11:CrAcctNo>  
          <v11:CrCcy>TWD</v11:CrCcy>  
          <v11:CrAmt>3500</v11:CrAmt> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:FundXferAddRq> 
  </soap:Body> 
</soap:Envelope>
